```
`Terraform will perform the following actions:

  # module.avenger-eks.data.aws_eks_cluster.default will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "default"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "dev"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.avenger-eks.data.aws_eks_cluster_auth.default will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "default"  {
      + id    = (known after apply)
      + name  = "dev"
      + token = (sensitive value)
    }

  # module.avenger-eks.aws_iam_openid_connect_provider.cluster must be replaced
-/+ resource "aws_iam_openid_connect_provider" "cluster" {
      ~ arn             = "arn:aws:iam::ACCOUNTNUMBER:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/IDTHATDOESNOTCHANGE" -> (known after apply)
        client_id_list  = [
            "sts.amazonaws.com",
        ]
      ~ id              = "arn:aws:iam::ACCOUNTNUMBER:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/IDTHATDOESNOTCHANGE" -> (known after apply)
        thumbprint_list = [
            "THUMBPRINTTHATDOESNOTCHANGE",
        ]
      ~ url             = "oidc.eks.us-east-1.amazonaws.com/id/IDTHATDOESNOTCHANGE" -> (known after apply) # forces replacement
    }

  # module.avenger-eks.module.alb.data.aws_iam_policy_document.alb_ingress[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "alb_ingress"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "acm:DescribeCertificate",
              + "acm:GetCertificate",
              + "acm:ListCertificates",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:AuthorizeSecurityGroupIngress",
              + "ec2:CreateSecurityGroup",
              + "ec2:CreateTags",
              + "ec2:DeleteSecurityGroup",
              + "ec2:DeleteTags",
              + "ec2:DescribeAccountAttributes",
              + "ec2:DescribeAddresses",
              + "ec2:DescribeInstanceStatus",
              + "ec2:DescribeInstances",
              + "ec2:DescribeInternetGateways",
              + "ec2:DescribeNetworkInterfaces",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSubnets",
              + "ec2:DescribeTags",
              + "ec2:DescribeVpcs",
              + "ec2:ModifyInstanceAttribute",
              + "ec2:ModifyNetworkInterfaceAttribute",
              + "ec2:RevokeSecurityGroupIngress",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:AddListenerCertificates",
              + "elasticloadbalancing:AddTags",
              + "elasticloadbalancing:CreateListener",
              + "elasticloadbalancing:CreateLoadBalancer",
              + "elasticloadbalancing:CreateRule",
              + "elasticloadbalancing:CreateTargetGroup",
              + "elasticloadbalancing:DeleteListener",
              + "elasticloadbalancing:DeleteLoadBalancer",
              + "elasticloadbalancing:DeleteRule",
              + "elasticloadbalancing:DeleteTargetGroup",
              + "elasticloadbalancing:DeregisterTargets",
              + "elasticloadbalancing:DescribeListenerCertificates",
              + "elasticloadbalancing:DescribeListeners",
              + "elasticloadbalancing:DescribeLoadBalancerAttributes",
              + "elasticloadbalancing:DescribeLoadBalancers",
              + "elasticloadbalancing:DescribeRules",
              + "elasticloadbalancing:DescribeSSLPolicies",
              + "elasticloadbalancing:DescribeTags",
              + "elasticloadbalancing:DescribeTargetGroupAttributes",
              + "elasticloadbalancing:DescribeTargetGroups",
              + "elasticloadbalancing:DescribeTargetHealth",
              + "elasticloadbalancing:ModifyListener",
              + "elasticloadbalancing:ModifyLoadBalancerAttributes",
              + "elasticloadbalancing:ModifyRule",
              + "elasticloadbalancing:ModifyTargetGroup",
              + "elasticloadbalancing:ModifyTargetGroupAttributes",
              + "elasticloadbalancing:RegisterTargets",
              + "elasticloadbalancing:RemoveListenerCertificates",
              + "elasticloadbalancing:RemoveTags",
              + "elasticloadbalancing:SetIpAddressType",
              + "elasticloadbalancing:SetSecurityGroups",
              + "elasticloadbalancing:SetSubnets",
              + "elasticloadbalancing:SetWebACL",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:CreateServiceLinkedRole",
              + "iam:GetServerCertificate",
              + "iam:ListServerCertificates",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "waf-regional:AssociateWebACL",
              + "waf-regional:DisassociateWebACL",
              + "waf-regional:GetWebACL",
              + "waf-regional:GetWebACLForResource",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "tag:GetResources",
              + "tag:TagResources",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "waf:GetWebACL",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.avenger-eks.module.alb.data.aws_iam_policy_document.alb_ingress_assume[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "alb_ingress_assume"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:alb-ingress:aws-alb-ingress-controller",
                ]
              + variable = "oidc.eks.us-east-1.amazonaws.com/id/IDTHATDOESNOTCHANGE:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.avenger-eks.module.alb.aws_iam_policy.alb_ingress[0] will be updated in-place
  ~ resource "aws_iam_policy" "alb_ingress" {
        arn         = "arn:aws:iam::ACCOUNTNUMBER:policy/dev-alb-ingress"
        description = "Policy for alb-ingress service"
        id          = "arn:aws:iam::ACCOUNTNUMBER:policy/dev-alb-ingress"
        name        = "dev-alb-ingress"
        path        = "/"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "acm:ListCertificates",
                          - "acm:GetCertificate",
                          - "acm:DescribeCertificate",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:RevokeSecurityGroupIngress",
                          - "ec2:ModifyNetworkInterfaceAttribute",
                          - "ec2:ModifyInstanceAttribute",
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DescribeInternetGateways",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeInstanceStatus",
                          - "ec2:DescribeAddresses",
                          - "ec2:DescribeAccountAttributes",
                          - "ec2:DeleteTags",
                          - "ec2:DeleteSecurityGroup",
                          - "ec2:CreateTags",
                          - "ec2:CreateSecurityGroup",
                          - "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:SetWebACL",
                          - "elasticloadbalancing:SetSubnets",
                          - "elasticloadbalancing:SetSecurityGroups",
                          - "elasticloadbalancing:SetIpAddressType",
                          - "elasticloadbalancing:RemoveTags",
                          - "elasticloadbalancing:RemoveListenerCertificates",
                          - "elasticloadbalancing:RegisterTargets",
                          - "elasticloadbalancing:ModifyTargetGroupAttributes",
                          - "elasticloadbalancing:ModifyTargetGroup",
                          - "elasticloadbalancing:ModifyRule",
                          - "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          - "elasticloadbalancing:ModifyListener",
                          - "elasticloadbalancing:DescribeTargetHealth",
                          - "elasticloadbalancing:DescribeTargetGroups",
                          - "elasticloadbalancing:DescribeTargetGroupAttributes",
                          - "elasticloadbalancing:DescribeTags",
                          - "elasticloadbalancing:DescribeSSLPolicies",
                          - "elasticloadbalancing:DescribeRules",
                          - "elasticloadbalancing:DescribeLoadBalancers",
                          - "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          - "elasticloadbalancing:DescribeListeners",
                          - "elasticloadbalancing:DescribeListenerCertificates",
                          - "elasticloadbalancing:DeregisterTargets",
                          - "elasticloadbalancing:DeleteTargetGroup",
                          - "elasticloadbalancing:DeleteRule",
                          - "elasticloadbalancing:DeleteLoadBalancer",
                          - "elasticloadbalancing:DeleteListener",
                          - "elasticloadbalancing:CreateTargetGroup",
                          - "elasticloadbalancing:CreateRule",
                          - "elasticloadbalancing:CreateLoadBalancer",
                          - "elasticloadbalancing:CreateListener",
                          - "elasticloadbalancing:AddTags",
                          - "elasticloadbalancing:AddListenerCertificates",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "iam:ListServerCertificates",
                          - "iam:GetServerCertificate",
                          - "iam:CreateServiceLinkedRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "waf-regional:GetWebACLForResource",
                          - "waf-regional:GetWebACL",
                          - "waf-regional:DisassociateWebACL",
                          - "waf-regional:AssociateWebACL",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "tag:TagResources",
                          - "tag:GetResources",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "waf:GetWebACL"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.avenger-eks.module.alb.aws_iam_role.alb_ingress[0] will be updated in-place
  ~ resource "aws_iam_role" "alb_ingress" {
        arn                   = "arn:aws:iam::ACCOUNTNUMBER:role/dev-alb-ingress"
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.us-east-1.amazonaws.com/id/IDTHATDOESNOTCHANGE:sub = "system:serviceaccount:alb-ingress:aws-alb-ingress-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::ACCOUNTNUMBER:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/IDTHATDOESNOTCHANGE"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        create_date           = "2020-06-30T19:13:18Z"
        force_detach_policies = false
        id                    = "dev-alb-ingress"
        max_session_duration  = 3600
        name                  = "dev-alb-ingress"
        path                  = "/"
        tags                  = {}
        unique_id             = "AROA2HZ2TRH37WLIILHUZ"
    }

Plan: 1 to add, 2 to change, 1 to destroy.
`
```